Revit 2024 API
BuiltInFailures.BendFailures.NotBentOpening Property
 While making curved beam type "[Type Name]" Opening elements were not created
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NotBentOpening { get; }
Visual Basic
Public Shared ReadOnly Property NotBentOpening As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NotBentOpening {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.BendFailures Class
Autodesk.Revit.DB Namespace